Repository: biblibre/omeka-s-module-KohaImport
Catalog: language/*.po
Languages: fr

source: Import from Koha
fr: Importer depuis Koha

source: Mappings
fr: Correspondances

source: Past imports
fr: Imports passés

source: None import yet
fr: Aucun import

source: None site selected
fr: Aucun site sélectionné

source: None options
fr: Aucune options

source: Job details
fr: Détails de la tâche

source: KohaImport module is not correctly configured. Please read the README.md file provided with the module.
fr: Le module KohaImport n'est pas correctement configuré. Lisez le README.md fourni dans les sources.

source: Importing in background (%sjob #%d%s)
fr: Import en tâche de fond (%sjob #%d%s)

source: Import name
fr: Nom de l'import

source: Medias source
fr: Source des médias

source: Choose between local or S3 bucket server
fr: Choisissez entre un serveur local et un bucket S3

source: Local server
fr: Serveur local

source: Medias path
fr: Chemin des médias

source: Only used for local server option
fr: Utilisé uniquement dans le cas d'un serveur local

source: Select resource type to import
fr: Sélectionner le type de ressource à importer

source: Sites for resources
fr: Site(s) pour les ressources

source: Select owner
fr: Sélectionner le propriétaire

source: Since
fr: Depuis

source: Should be a datetime formatted like this: YYYY-mm-dd HH:MM:SS
fr: Doit être une date formattée comme ceci: AAAA-mm-jj HH:MM:SS

source: Force
fr: Forcer

source: Force update even when it seems the resource is already up-to-date
fr: Forcer la mise à jour même si la ressource semble déjà être à jour

source: Delete Omeka S resources that are not exported by Koha anymore
fr: Supprimer les ressources Omeka S qui ne sont plus exportées par Koha

source: Mapped field with resource type
fr: Champ défini pour le type de resource

source: e.g. "214$a"
fr: ex. "214$a"

source: Mapped value with resource type
fr: Valeur définie pour le type de resource

source: e.g. "foo"
fr: ex. "foo"

source: Select an import profile
fr: Sélectionner un profil d'import

source: Select resource template…
fr: Sélectionner un modèle de ressource…

source: Resource visibility
fr: Visibilité de la ressource
