Repository: biblibre/omeka-s-module-KohaImport
Catalog: documentation/locales/*/LC_MESSAGES/features.po
Languages: fr

source: Features
fr: Fonctionnalités

source: Start an import
fr: Démarrer un import

source: In the first view, several options are available:
fr: Dans la première vue, plusieurs options sont disponibles:

source: Import name: just to specify and easily identify your import (can be duplicated)
fr: Nom de l'import: utile pour préciser et identifier votre import (peut être dupliqué)

source: Media ingest file:
fr: Source des médias:

source: Local server as for the usual workflow, specify the path to the folder where your media is stored. If no path is specified, media ingestion will be ignored.
fr: Serveur local est la solution habituelle, spécifier le chemin du dossier local contenant les médias. Si aucun chemin n'est spécifié, le traitement des médias sera ignoré.

source: S3 bucket: you can choose this option if the media is stored remotely on a bucket, but don't forget to add your configuration in the `module.config.php` file.
fr: S3 bucket: vous pouvez choisir cette option si les médias sont stockés à distance dans un bucket, mais n'oubliez pas d'indiquer sa configuration dans le fichier `module.config.php`.

source: Type of resource to import (required).
fr: Type de ressource à importer (requis)

source: Sites: add the sites for the resources to be imported.
fr: Sites : ajouter les sites pour les ressources à importer.

source: Owner (required)
fr: Propriétaire (requis)

source: Since: specified date formatted as “YYYY-mm-dd HH:MM:SS” to filter resources.
fr: Depuis: spécifier une date formattée comme ceci “AAAA-mm-jj HH:MM:SS” pour filtrer les ressources.

source: Force: even if the resource (identified by the `biblionumber`) has already been imported and its update date is equal to today's date, you can force the import by checking this box.
fr: Force : même si la ressource (identifiée par le `biblionumber`) a déjà été importée et que sa date de mise à jour est égale à la date du jour, vous pouvez forcer son import en cochant la case.

source: Delete: used to delete an omeka-s resource if the corresponding resource in koha is no longer to be exported.
fr: Supprimer : utiliser pour supprimer une ressource omeka-s si la ressource koha correspondante n'est plus à exporter.

source: Configuration by resource type
fr: Configuration par type de ressource

source: After initiating the configuration of a new import, you can then define parameters specific to each type of resource. Configurations differ according to the resource type tab you are in. You will therefore find some common parameters:
fr: Après l'initialisation d'un nouvel import, vous pouvez définir des paramètres spécifiques pour chaque type de ressource. Les configurations s'appliquent sur le type de resource actif via l'onglet. Vous trouverez donc des paramètres communs:

source: Mapped field/value with resource type: you'll be able to filter resources, to transform “only” the corresponding resources, apply to the data field on the “field$subfield” format with a value strictly equal to the entry below.
fr: Correspondance champ/valeur selon le type de ressource: vous pouvez filtrer les ressources, pour transformer "uniquement" les ressources correspondantes, s'applique sur le format “champ$sous-champ” avec la valeur strictement égale à l'entrée suivante.

source: Note that these fields are mandatory if you have selected more than one type of resource to import. Otherwise, if these parameters are not filled in, all records passing through the import will be transformed into OmekaS resources of the specified type.
fr: A noter que ces champs sont obligatoires si vous avez sélectionner plusieurs types de ressources Dans le cas contraire si aucun paramètre n'est renseigné, toutes les notices passant dans l'import seront transformées en ressources OmekaS en rapport avec le type de ressource précisé.

source: Select an import profile: import profiles are used to apply mappings between Koha fields and OmekaS properties. You can therefore customize the mapping according to the type of resource.
fr: Sélectionner un profil d'import: les profiles d'import sont utilisés pour appliquer des correspondances entre les champs Koha et des propriétés OmekaS. Vous pouvez donc personnalisé les correspondances selon les types de ressource.

source: Classes and resource templates: choose different parameters for different resource types.
fr: Classes et modèles de ressources: peuvent être définis indépendamment selon le type de ressource.

source: Resource visibility (required)
fr: Visibilité de la ressource (requis)

source: Add to item sets: only for 'item' resources.
fr: Ajouter aux collections: seulement pour les ressources de type 'contenu'.

source: Past imports
fr: Imports passés

source: Resume past imports on a dedicated page.
fr: Résumé des imports passés sur une page dédiée.

source: (Admin > KohaImport > Past imports)
fr: (Admin > KohaImport > Imports passés)

source: And you've got also possibility to view the configuration applied by clicking on `...`.
fr: Et vous avez la possibilité de voir un rappel de la configuration appliquée en cliquant sur `...`.
